{
  "Welcome to Konnektoren": "مرحبًا بكم في Konnektoren",
  "About this Learning Platform": "حول منصة التعلم هذه",
  "Please select a language from the dropdown.": "يرجى اختيار لغة من القائمة المنسدلة.",
  "Please select a language:": "يرجى اختيار لغة.",
  "Select Language": "اختر لغة",
  "This platform is dedicated to helping individuals improve their understanding and use of German grammar. Specifically, you can learn about:": "تُكرس هذه المنصة لمساعدة الأفراد على تحسين فهمهم واستخدامهم لقواعد اللغة الألمانية. على وجه التحديد، يمكنك التعرف على:",
  "Config": "الإعدادات",
  "Player Profile": "ملف اللاعب",
  "Use a nickname as your name. It will be used for certificates and displayed on the leaderboard.": "استخدم اسم مستعار كاسمك. سيتم استخدامه للشهادات وعرضه على لوحة المتصدرين.",
  "Connect your Solana account to receive NFTs as rewards for top players.": "قم بربط حسابك في Solana لتلقي الرموز غير القابلة للاستبدال كمكافآت لأفضل اللاعبين.",
  "Name (Nickname): ": "الاسم (الاسم المستعار): ",
  "Solana Account: ": "حساب Solana: ",
  "Learning History": "تاريخ التعلم",
  "Tests Taken by Type": "الاختبارات المتخذة حسب النوع",
  "Average Performance by Test Type": "الأداء الوسطي حسب نوع الاختبار",
  "Test History": "تاريخ الاختبار",
  "Leaderboard": "لوحة المتصدرين",
  "Loading...": "جار التحميل...",
  "Only the top 25% of the leaderboard is shown.": "يتم عرض فقط أعلى 25% من لوحة المتصدرين.",
  "Konnektoren": "Konnektoren",
  ": Understand how to connect clauses and sentences to improve the flow of your German writing and speaking.": ": فهم كيفية ربط الجمل والعبارات لتحسين تدفق كتابتك وتحدثك بالألمانية.",
  "Adjektive": "الصفات",
  ": Dive into the use of adjectives, including those with prepositions, to add detail and depth to your descriptions.": ": اغمر نفسك في استخدام الصفات، بما في ذلك تلك التي مع حروف الجر، لإضافة تفاصيل وعمق إلى وصفك.",
  "Verben": "الأفعال",
  ": Master the use of verbs, particularly those with prepositions, to express actions and states more effectively.": ": أتقن استخدام الأفعال، خاصة تلك التي مع حروف الجر، للتعبير عن الأفعال والحالات بشكل أكثر فعالية.",
  "Through interactive tests and comprehensive examples, this platform aims to enhance your German grammar skills, making you more confident in your language abilities.": "من خلال الاختبارات التفاعلية والأمثلة الشاملة، تهدف هذه المنصة إلى تعزيز مهاراتك في قواعد اللغة الألمانية، مما يجعلك أكثر ثقة في قدراتك اللغوية.",
  "The Konnektoren examples featured here are derived from the German DTB C1 Course.": "الأمثلة على Konnektoren المعروضة هنا مشتقة من دورة اللغة الألمانية DTB C1.",
  "Special thanks to the educators and learners at the IFS Academy for their contributions to the course materials.": "شكر خاص للمعلمين والمتعلمين في أكاديمية IFS على مساهماتهم في مواد الدورة.",
  "Profile": "الملف الشخصي",
  "History": "التاريخ",
  "About": "حول",
  "Congratulations!": "تهانينا!",
  "Outstanding! You've mastered this topic with excellent results.": "ممتاز! لقد أتقنت هذا الموضوع بنتائج ممتازة.",
  "Excellent job! You're well on your way to becoming an expert.": "عمل رائع! أنت في طريقك لتصبح خبيرًا.",
  "Very good! Your hard work is paying off.": "جيد جدا! عملك الشاق يؤتي ثماره.",
  "Good job! Keep studying, and you'll see even more improvement.": "عمل جيد! استمر في الدراسة، وسترى تحسنًا أكبر.",
  "A solid attempt! Review the materials and try again for a better score.": "محاولة صلبة! راجع المواد وحاول مرة أخرى للحصول على درجة أفضل.",
  "It looks like this topic is still a bit tough for you. Don't worry, with more practice, you'll get there!": "يبدو أن هذا الموضوع لا يزال صعبًا بعض الشيء بالنسبة لك. لا تقلق، مع المزيد من الممارسة، ستصل إلى هناك!",
  "Konnektoren are conjunctions that connect two clauses or sentences. They are used to express the relationship between the two clauses or sentences.": "Konnektoren هي أدوات ربط تربط بين جملتين أو عبارتين. يتم استخدامها للتعبير عن العلاقة بين الجملتين أو العبارتين.",
  "There are three types of Konnektoren and two types of exceptions:": "هناك ثلاثة أنواع من Konnektoren ونوعان من الاستثناءات:",
  "Konnektoren mit Nebensatz (Verb am Ende) (= Subjunktionen)": "Konnektoren مع الجمل الفرعية (الفعل في النهاية) (= Subjunktionen)",
  "Konnektoren mit Hauptsatz (Position 0) (= Konjunktionen)": "Konnektoren مع الجمل الرئيسية (الموضع 0) (= Konjunktionen)",
  "Konnektoren mit Hauptsatz (Position 1) (= Konjunktionaladverbien)": "Konnektoren مع الجمل الرئيسية (الموضع 1) (= Konjunktionaladverbien)",
  "Konnektoren mit Infinitivgruppe": "Konnektoren مع مجموعة الصيغة الاسمية",
  "Konnektoren mit besonderer Position": "Konnektoren بمواضع خاصة",
  "Each type of Konnektor has its own set of rules and usage, and mastering them will help you express yourself more clearly and effectively in German.": "لكل نوع من أنواع Konnektor مجموعة قواعده واستخداماته الخاصة، وإتقانها سيساعدك على التعبير عن نفسك بشكل أوضح وأكثر فعالية باللغة الألمانية.",
  "Your Task": "مهمتك",
  "You will be shown a Konnektor and you will have to select the correct group it belongs to. This exercise aims to help you understand the usage and position of different Konnektoren within a sentence.": "سيتم عرض Konnektor عليك ويجب عليك اختيار المجموعة الصحيحة التي ينتمي إليها. تهدف هذه التمرين إلى مساعدتك على فهم استخدام وموقع Konnektoren المختلفة ضمن جملة.",
  "To successfully complete this task, you should:": "لإكمال هذه المهمة بنجاح، يجب عليك:",
  "First, find the Konnektor in the given sentence. Most sentences will have two parts, typically separated by a comma.": "أولاً، ابحث عن Konnektor في الجملة المعطاة. معظم الجمل ستكون لها جزئين، يفصل بينهما عادةً فاصلة.",
  "Identify to which part of the sentence the Konnektor belongs.": "حدد إلى أي جزء من الجملة ينتمي Konnektor.",
  "Next, find the verb in the sentence and analyze its position.": "بعد ذلك، ابحث عن الفعل في الجملة وحلل موقعه.",
  "Based on the position of the verb and the part of the sentence the Konnektor belongs to, select the correct group of Konnektoren.": "استنادًا إلى موقع الفعل والجزء من الجملة الذي ينتمي إليه Konnektor، اختر المجموعة الصحيحة من Konnektoren.",
  "Words in the parentheses, behind the group name, are meant to help you memorize the rules of the Konnektor and the group to which it belongs.": "الكلمات في الأقواس، خلف اسم المجموعة، تهدف إلى مساعدتك على حفظ قواعد Konnektor والمجموعة التي ينتمي إليها.",
  "By practicing the identification and correct classification of Konnektoren, you will enhance your ability to construct and understand complex German sentences.": "من خلال ممارسة التعرف والتصنيف الصحيح لـ Konnektoren، ستعزز قدرتك على بناء وفهم الجمل الألمانية المعقدة.",
  "Konnektoren: Test Your Knowledge": "Konnektoren: اختبر معرفتك",
  "The Konnektoren test mode is designed for learners who want to challenge their understanding of German conjunctions without the need for examples.": "وضع اختبار Konnektoren مصمم للمتعلمين الذين يرغبون في تحدي فهمهم لأدوات الربط الألمانية دون الحاجة إلى أمثلة.",
  "Who needs it?": "من يحتاج إليه؟",
  "Individuals looking to assess their knowledge of Konnektoren.": "الأفراد الذين يتطلعون إلى تقييم معرفتهم بـ Konnektoren.",
  "Those preparing for a German language exam and wishing to test themselves in advance.": "أولئك الذين يستعدون لامتحان اللغة الألمانية ويتمنون اختبار أنفسهم مسبقًا.",
  "Learners seeking a quick and efficient way to master all Konnektoren.": "المتعلمون الذين يبحثون عن طريقة سريعة وفعالة لإتقان جميع Konnektoren.",
  "Why do you need it?": "لماذا تحتاج إليه؟",
  "Konnektoren are crucial for passing German exams.": "Konnektoren ضرورية لاجتياز امتحانات اللغة الألمانية.",
  "Enhances understanding of the German language.": "تعزز فهم اللغة الألمانية.",
  "Common errors in using Konnektoren can cause misunderstandings and mistakes.": "الأخطاء الشائعة في استخدام Konnektoren يمكن أن تسبب سوء الفهم والأخطاء.",
  "It's a fundamental aspect of the language that every learner should master.": "إنه جانب أساسي من اللغة يجب على كل متعلم إتقانه.",
  "Mastering Konnektoren is key to success in any German language examination. By learning them thoroughly, you will be able to speak and write in German confidently, clearly, and without mistakes. Prepare to impress with your flawless grammar and articulate expression!": "إتقان Konnektoren هو مفتاح النجاح في أي امتحان للغة الألمانية. من خلال تعلمها بعناية، ستكون قادرًا على التحدث والكتابة باللغة الألمانية بثقة ووضوح وبدون أخطاء. استعد لإبهار الجميع بقواعد لغتك الخالية من العيوب وتعبيرك الواضح!",
  "Embrace the challenge, elevate your German, and speak with pride. Your journey to German fluency starts now!": "تحدى نفسك، حسن من مستواك في الألمانية، وتحدث بفخر. رحلتك نحو إتقان الألمانية تبدأ الآن!",
  "Adjectives are words that describe or modify another person or thing in the sentence. In German, adjectives can precede the noun they describe, which is known as the attributive position, or they can appear in the predicate, following a form of the verb to be (sein), which is known as the predicative position.": "الصفات هي كلمات تصف أو تعدل شخصًا آخر أو شيئًا في الجملة. في الألمانية، يمكن للصفات أن تسبق الاسم الذي تصفه، والذي يُعرف بالموقع النعتي، أو يمكن أن تظهر في الحكم، تلي صيغة من الفعل كون (sein)، والذي يُعرف بالموقع التوصيفي.",
  "One of the key features of German adjectives is declension. German adjectives change their endings based on the gender, case, and number of the nouns they describe. This declension can seem daunting at first, but it is crucial for the correct sentence structure and meaning.": "إحدى السمات الرئيسية للصفات الألمانية هي الانحناء. تغير الصفات الألمانية أواخرها بناءً على جنس الأسماء وحالتها وعددها التي تصفها. قد يبدو هذا الانحناء مخيفًا في البداية، لكنه ضروري للتركيب الصحيح للجملة ومعناها.",
  "There are three types of adjectives in German based on their declension patterns:": "هناك ثلاثة أنواع من الصفات في الألمانية بناءً على أنماط انحنائها:",
  "Weak declension": "الانحناء الضعيف",
  "Strong declension": "الانحناء القوي",
  "Mixed declension": "الانحناء المختلط",
  "Understanding when to use which declension is essential for mastering German adjectives.": "فهم متى يُستخدم أي انحناء أمر ضروري لإتقان الصفات الألمانية.",
  "You will be presented with sentences where you must identify the correct form of the adjective based on the context of the sentence. This exercise will help you understand the declension of adjectives and how they change to match the nouns they describe.": "سيتم تقديم جمل لك حيث يجب عليك تحديد الشكل الصحيح للصفة بناءً على سياق الجملة. ستساعدك هذه التمرين على فهم انحناء الصفات وكيفية تغيرها لتتناسب مع الأسماء التي تصفها.",
  "To successfully complete this task, consider the following steps:": "لإتمام هذه المهمة بنجاح، ضع في اعتبارك الخطوات التالية:",
  "Identify the noun that the adjective describes.": "حدد الاسم الذي تصفه الصفة.",
  "Determine the gender, case, and number of the noun.": "حدد جنس الاسم وحالته وعدده.",
  "Select the correct adjective form based on the declension pattern.": "اختر شكل الصفة الصحيح بناءً على نمط الانحناء.",
  "Practicing with a variety of sentences will help you become more comfortable with adjective declension and usage in German.": "الممارسة مع مجموعة متنوعة من الجمل ستساعدك على أن تصبح أكثر راحة مع انحناء الصفات واستخدامها في الألمانية.",
  "Adjectives: Test Your Knowledge": "الصفات: اختبر معرفتك",
  "Challenge your understanding of German adjectives with this test mode, designed for learners seeking to assess and improve their adjective usage.": "تحدى فهمك للصفات الألمانية مع هذا الوضع الاختباري، المصمم للمتعلمين الذين يسعون لتقييم وتحسين استخدامهم للصفات.",
  "Why it's beneficial:": "لماذا هو مفيد:",
  "Assess your knowledge of adjective declension and placement.": "قيم معرفتك بانحناء الصفات وتوضعها.",
  "Identify areas for improvement in adjective usage.": "حدد المجالات التي تحتاج إلى تحسين في استخدام الصفات.",
  "Prepare for German language exams with focused practice.": "استعد لامتحانات اللغة الألمانية بممارسة مركزة.",
  "Mastering adjectives is essential for expressing detailed and accurate descriptions in German. Take this opportunity to strengthen your skills and build confidence in your German language abilities.": "إتقان الصفات أمر ضروري للتعبير عن وصف دقيق ومفصل بالألمانية. اغتنم هذه الفرصة لتعزيز مهاراتك وبناء الثقة في قدراتك اللغوية الألمانية.",
  "Dive into the challenge and emerge with a deeper understanding of German adjectives. Your path to German fluency is enriched with every step forward!": "انغمس في التحدي واخرج بفهم أعمق للصفات الألمانية. يثرى مسارك نحو إتقان الألمانية مع كل خطوة إلى الأمام!",
  "Verbs are the most important part of any sentence. They are the action words that express what the subject is doing. In German, verbs are conjugated to match the subject of the sentence, and they can be used in different tenses and moods.": "الأفعال هي أهم جزء في أي جملة. هي كلمات الفعل التي تعبر عن ما يقوم به الفاعل. في الألمانية، يتم تصريف الأفعال لتتناسب مع فاعل الجملة، ويمكن استخدامها في أزمنة وأجواء مختلفة.",
  "There are three types of verbs in German:": "هناك ثلاثة أنواع من الأفعال في الألمانية:",
  "Regular verbs": "الأفعال القياسية",
  "Irregular verbs": "الأفعال غير القياسية",
  "Modal verbs": "الأفعال الناقصة",
  "Each type of verb has its own set of rules and usage, and mastering them will help you express yourself more clearly and effectively in German.": "كل نوع من الأفعال له مجموعة قواعده واستخداماته الخاصة، وإتقانها سيساعدك على التعبير عن نفسك بشكل أوضح وأكثر فعالية بالألمانية.",
  "By practicing the identification and correct classification of verbs, you will enhance your ability to construct and understand complex German sentences.": "من خلال ممارسة تحديد الأفعال وتصنيفها بشكل صحيح، ستعزز قدرتك على بناء وفهم الجمل الألمانية المعقدة.",
  "Verben: Test Your Knowledge": "Verben: اختبر معرفتك",
  "The Verben test mode is designed for learners who want to challenge their understanding of German verbs without the need for examples.": "وضع اختبار Verben مصمم للمتعلمين الذين يرغبون في تحدي فهمهم للأفعال الألمانية دون الحاجة إلى أمثلة.",
  "Individuals looking to assess their knowledge of German verbs.": "الأفراد الراغبين في تقييم معرفتهم بالأفعال الألمانية.",
  "Learners seeking a quick and efficient way to master all German verbs.": "المتعلمون الذين يبحثون عن طريقة سريعة وفعالة لإتقان جميع الأفعال الألمانية.",
  "Verbs are crucial for passing German exams.": "الأفعال ضرورية لاجتياز امتحانات اللغة الألمانية.",
  "Common errors in using verbs can cause misunderstandings and mistakes.": "الأخطاء الشائعة في استخدام الأفعال يمكن أن تسبب سوء الفهم والأخطاء.",
  "Mastering verbs is key to success in any German language examination. By learning them thoroughly, you will be able to speak and write in German confidently, clearly, and without mistakes. Prepare to impress with your flawless grammar and articulate expression!": "إتقان الأفعال هو مفتاح النجاح في أي امتحان للغة الألمانية. من خلال تعلمها بعناية، ستكون قادرًا على التحدث والكتابة باللغة الألمانية بثقة ووضوح وبدون أخطاء. استعد لإبهار الجميع بقواعد لغتك الخالية من العيوب وتعبيرك الواضح!",
  "Connect Wallet": "قم بربط المحفظة"
}