{
  "Welcome to Konnektoren": "Bienvenido a Konnektoren",
  "About this Learning Platform": "Acerca de esta Plataforma de Aprendizaje",
  "Please select a language from the dropdown.": "Por favor, seleccione un idioma del menú desplegable.",
  "Please select a language:": "Por favor, seleccione un idioma:",
  "Select Language": "Seleccionar Idioma",
  "This platform is dedicated to helping individuals improve their understanding and use of German grammar. Specifically, you can learn about:": "Esta plataforma está dedicada a ayudar a las personas a mejorar su comprensión y uso de la gramática alemana. Específicamente, puede aprender sobre:",
  "Config": "Configuración",
  "Player Profile": "Perfil del Jugador",
  "Use a nickname as your name. It will be used for certificates and displayed on the leaderboard.": "Use un apodo como su nombre. Se utilizará para certificados y se mostrará en la tabla de clasificación.",
  "Connect your Solana account to receive NFTs as rewards for top players.": "Conecte su cuenta de Solana para recibir NFT como recompensa para los mejores jugadores.",
  "Name (Nickname): ": "Nombre (Apodo): ",
  "Solana Account: ": "Cuenta de Solana: ",
  "Learning History": "Historial de Aprendizaje",
  "Tests Taken by Type": "Pruebas Realizadas por Tipo",
  "Average Performance by Test Type": "Rendimiento Promedio por Tipo de Prueba",
  "Test History": "Historial de Pruebas",
  "Leaderboard": "Tabla de Clasificación",
  "Loading...": "Cargando...",
  "Only the top 25% of the leaderboard is shown.": "Solo se muestra el 25% superior de la tabla de clasificación.",
  "Konnektoren": "Konnektoren",
  ": Understand how to connect clauses and sentences to improve the flow of your German writing and speaking.": ": Entienda cómo conectar cláusulas y oraciones para mejorar el flujo de su escritura y habla en alemán.",
  "Adjektive": "Adjetivos",
  ": Dive into the use of adjectives, including those with prepositions, to add detail and depth to your descriptions.": ": Sumérgete en el uso de los adjetivos, incluidos aquellos con preposiciones, para agregar detalle y profundidad a tus descripciones.",
  "Verben": "Verbos",
  ": Master the use of verbs, particularly those with prepositions, to express actions and states more effectively.": ": Domine el uso de los verbos, especialmente aquellos con preposiciones, para expresar acciones y estados de manera más efectiva.",
  "Through interactive tests and comprehensive examples, this platform aims to enhance your German grammar skills, making you more confident in your language abilities.": "A través de pruebas interactivas y ejemplos completos, esta plataforma tiene como objetivo mejorar sus habilidades gramaticales en alemán, haciéndolo más seguro en sus habilidades lingüísticas.",
  "The Konnektoren examples featured here are derived from the German DTB C1 Course.": "Los ejemplos de Konnektoren presentados aquí se derivan del Curso DTB C1 en alemán.",
  "Special thanks to the educators and learners at the IFS Academy for their contributions to the course materials.": "Un agradecimiento especial a los educadores y aprendices de la Academia IFS por sus contribuciones a los materiales del curso.",
  "Profile": "Perfil",
  "History": "Historial",
  "About": "Acerca de",
  "Congratulations!": "¡Felicidades!",
  "Outstanding! You've mastered this topic with excellent results.": "¡Sobresaliente! Has dominado este tema con excelentes resultados.",
  "Excellent job! You're well on your way to becoming an expert.": "¡Excelente trabajo! Estás bien encaminado para convertirte en un experto.",
  "Very good! Your hard work is paying off.": "¡Muy bien! Tu arduo trabajo está dando resultados.",
  "Good job! Keep studying, and you'll see even more improvement.": "¡Buen trabajo! Sigue estudiando, y verás aún más mejoras.",
  "A solid attempt! Review the materials and try again for a better score.": "¡Un intento sólido! Revisa los materiales e intenta nuevamente para obtener una mejor puntuación.",
  "It looks like this topic is still a bit tough for you. Don't worry, with more practice, you'll get there!": "Parece que este tema todavía es un poco difícil para ti. ¡No te preocupes, con más práctica, lo lograrás!",
  "Konnektoren are conjunctions that connect two clauses or sentences. They are used to express the relationship between the two clauses or sentences.": "Konnektoren son conjunciones que conectan dos cláusulas u oraciones. Se utilizan para expresar la relación entre las dos cláusulas u oraciones.",
  "There are three types of Konnektoren and two types of exceptions:": "Hay tres tipos de Konnektoren y dos tipos de excepciones:",
  "Konnektoren mit Nebensatz (Verb am Ende) (= Subjunktionen)": "Konnektoren con oración subordinada (verbo al final) (= Subjunciones)",
  "Konnektoren mit Hauptsatz (Position 0) (= Konjunktionen)": "Konnektoren con oración principal (Posición 0) (= Conjunciones)",
  "Konnektoren mit Hauptsatz (Position 1) (= Konjunktionaladverbien)": "Konnektoren con oración principal (Posición 1) (= Adverbios Conjuntivos)",
  "Konnektoren mit Infinitivgruppe": "Konnektoren con grupo infinitivo",
  "Konnektoren mit besonderer Position": "Konnektoren con posición especial",
  "Each type of Konnektor has its own set of rules and usage, and mastering them will help you express yourself more clearly and effectively in German.": "Cada tipo de Konnektor tiene su propio conjunto de reglas y uso, y dominarlos le ayudará a expresarse de manera más clara y efectiva en alemán.",
  "Your Task": "Tu tarea",
  "You will be shown a Konnektor and you will have to select the correct group it belongs to. This exercise aims to help you understand the usage and position of different Konnektoren within a sentence.": "Se te mostrará un Konnektor y tendrás que seleccionar el grupo correcto al que pertenece. Este ejercicio tiene como objetivo ayudarte a comprender el uso y la posición de diferentes Konnektoren dentro de una oración.",
  "To successfully complete this task, you should:": "Para completar esta tarea con éxito, deberías:",
  "First, find the Konnektor in the given sentence. Most sentences will have two parts, typically separated by a comma.": "Primero, encuentra el Konnektor en la oración dada. La mayoría de las oraciones tendrán dos partes, típicamente separadas por una coma.",
  "Identify to which part of the sentence the Konnektor belongs.": "Identifica a qué parte de la oración pertenece el Konnektor.",
  "Next, find the verb in the sentence and analyze its position.": "Luego, encuentra el verbo en la oración y analiza su posición.",
  "Based on the position of the verb and the part of the sentence the Konnektor belongs to, select the correct group of Konnektoren.": "Basándote en la posición del verbo y la parte de la oración a la que pertenece el Konnektor, selecciona el grupo correcto de Konnektoren.",
  "Words in the parentheses, behind the group name, are meant to help you memorize the rules of the Konnektor and the group to which it belongs.": "Las palabras entre paréntesis, detrás del nombre del grupo, están destinadas a ayudarte a memorizar las reglas del Konnektor y el grupo al que pertenece.",
  "By practicing the identification and correct classification of Konnektoren, you will enhance your ability to construct and understand complex German sentences.": "Al practicar la identificación y clasificación correcta de Konnektoren, mejorarás tu capacidad para construir y entender oraciones alemanas complejas.",
  "Konnektoren: Test Your Knowledge": "Konnektoren: Pon a Prueba tu Conocimiento",
  "The Konnektoren test mode is designed for learners who want to challenge their understanding of German conjunctions without the need for examples.": "El modo de prueba de Konnektoren está diseñado para aprendices que desean desafiar su comprensión de las conjunciones alemanas sin necesidad de ejemplos.",
  "Who needs it?": "¿Quién lo necesita?",
  "Individuals looking to assess their knowledge of Konnektoren.": "Personas que desean evaluar su conocimiento sobre Konnektoren.",
  "Those preparing for a German language exam and wishing to test themselves in advance.": "Quienes se preparan para un examen de alemán y desean evaluarse por adelantado.",
  "Learners seeking a quick and efficient way to master all Konnektoren.": "Estudiantes que buscan una forma rápida y eficiente de dominar todos los Konnektoren.",
  "Why do you need it?": "¿Por qué lo necesitas?",
  "Konnektoren are crucial for passing German exams.": "Los Konnektoren son cruciales para aprobar exámenes de alemán.",
  "Enhances understanding of the German language.": "Mejora la comprensión del idioma alemán.",
  "Common errors in using Konnektoren can cause misunderstandings and mistakes.": "Los errores comunes al usar Konnektoren pueden causar malentendidos y errores.",
  "It's a fundamental aspect of the language that every learner should master.": "Es un aspecto fundamental del idioma que todo estudiante debería dominar.",
  "Mastering Konnektoren is key to success in any German language examination. By learning them thoroughly, you will be able to speak and write in German confidently, clearly, and without mistakes. Prepare to impress with your flawless grammar and articulate expression!": "Dominar los Konnektoren es clave para el éxito en cualquier examen de alemán. Al aprenderlos a fondo, podrás hablar y escribir en alemán con confianza, claridad y sin errores. ¡Prepárate para impresionar con tu gramática impecable y expresión articulada!",
  "Embrace the challenge, elevate your German, and speak with pride. Your journey to German fluency starts now!": "Acepta el desafío, eleva tu alemán y habla con orgullo. ¡Tu viaje hacia la fluidez en alemán comienza ahora!",
  "Adjectives are words that describe or modify another person or thing in the sentence. In German, adjectives can precede the noun they describe, which is known as the attributive position, or they can appear in the predicate, following a form of the verb to be (sein), which is known as the predicative position.": "Los adjetivos son palabras que describen o modifican a otra persona o cosa en la oración. En alemán, los adjetivos pueden preceder al sustantivo que describen, lo que se conoce como posición atributiva, o pueden aparecer en el predicado, siguiendo una forma del verbo ser (sein), lo que se conoce como posición predicativa.",
  "One of the key features of German adjectives is declension. German adjectives change their endings based on the gender, case, and number of the nouns they describe. This declension can seem daunting at first, but it is crucial for the correct sentence structure and meaning.": "Una de las características clave de los adjetivos alemanes es la declinación. Los adjetivos alemanes cambian sus terminaciones según el género, caso y número de los sustantivos que describen. Esta declinación puede parecer intimidante al principio, pero es crucial para la estructura y el significado correctos de la oración.",
  "There are three types of adjectives in German based on their declension patterns:": "Hay tres tipos de adjetivos en alemán según sus patrones de declinación:",
  "Weak declension": "Declinación débil",
  "Strong declension": "Declinación fuerte",
  "Mixed declension": "Declinación mixta",
  "Understanding when to use which declension is essential for mastering German adjectives.": "Entender cuándo usar qué declinación es esencial para dominar los adjetivos alemanes.",
  "You will be presented with sentences where you must identify the correct form of the adjective based on the context of the sentence. This exercise will help you understand the declension of adjectives and how they change to match the nouns they describe.": "Se te presentarán oraciones donde deberás identificar la forma correcta del adjetivo según el contexto de la oración. Este ejercicio te ayudará a entender la declinación de los adjetivos y cómo cambian para coincidir con los sustantivos que describen.",
  "To successfully complete this task, consider the following steps:": "Para completar esta tarea con éxito, considera los siguientes pasos:",
  "Identify the noun that the adjective describes.": "Identifica el sustantivo que describe el adjetivo.",
  "Determine the gender, case, and number of the noun.": "Determina el género, caso y número del sustantivo.",
  "Select the correct adjective form based on the declension pattern.": "Selecciona la forma correcta del adjetivo según el patrón de declinación.",
  "Practicing with a variety of sentences will help you become more comfortable with adjective declension and usage in German.": "Practicar con una variedad de oraciones te ayudará a sentirte más cómodo con la declinación y el uso de los adjetivos en alemán.",
  "Adjectives: Test Your Knowledge": "Adjetivos: Pon a Prueba tu Conocimiento",
  "Challenge your understanding of German adjectives with this test mode, designed for learners seeking to assess and improve their adjective usage.": "Desafía tu comprensión de los adjetivos alemanes con este modo de prueba, diseñado para estudiantes que buscan evaluar y mejorar su uso de los adjetivos.",
  "Why it's beneficial:": "Por qué es beneficioso:",
  "Assess your knowledge of adjective declension and placement.": "Evalúa tu conocimiento de la declinación y colocación de adjetivos.",
  "Identify areas for improvement in adjective usage.": "Identifica áreas para mejorar en el uso de adjetivos.",
  "Prepare for German language exams with focused practice.": "Prepárate para los exámenes de alemán con práctica enfocada.",
  "Mastering adjectives is essential for expressing detailed and accurate descriptions in German. Take this opportunity to strengthen your skills and build confidence in your German language abilities.": "Dominar los adjetivos es esencial para expresar descripciones detalladas y precisas en alemán. Aprovecha esta oportunidad para fortalecer tus habilidades y construir confianza en tus habilidades en el idioma alemán.",
  "Dive into the challenge and emerge with a deeper understanding of German adjectives. Your path to German fluency is enriched with every step forward!": "Sumérgete en el desafío y emerge con un entendimiento más profundo de los adjetivos alemanes. ¡Tu camino hacia la fluidez en alemán se enriquece con cada paso adelante!",
  "Verbs are the most important part of any sentence. They are the action words that express what the subject is doing. In German, verbs are conjugated to match the subject of the sentence, and they can be used in different tenses and moods.": "Los verbos son la parte más importante de cualquier oración. Son las palabras de acción que expresan lo que está haciendo el sujeto. En alemán, los verbos se conjugan para coincidir con el sujeto de la oración, y pueden ser utilizados en diferentes tiempos y modos.",
  "There are three types of verbs in German:": "Hay tres tipos de verbos en alemán:",
  "Regular verbs": "Verbos regulares",
  "Irregular verbs": "Verbos irregulares",
  "Modal verbs": "Verbos modales",
  "Each type of verb has its own set of rules and usage, and mastering them will help you express yourself more clearly and effectively in German.": "Cada tipo de verbo tiene su propio conjunto de reglas y uso, y dominarlos te ayudará a expresarte de manera más clara y efectiva en alemán.",
  "By practicing the identification and correct classification of verbs, you will enhance your ability to construct and understand complex German sentences.": "Al practicar la identificación y clasificación correcta de los verbos, mejorarás tu habilidad para construir y entender oraciones complejas en alemán.",
  "Verbs: Test Your Knowledge": "Verbos: Pon a Prueba tu Conocimiento",
  "The Verbs test mode is designed for learners who want to challenge their understanding of German verbs without the need for examples.": "El modo de prueba de Verbos está diseñado para estudiantes que desean desafiar su comprensión de los verbos alemanes sin necesidad de ejemplos.",
  "Individuals looking to assess their knowledge of German verbs.": "Personas que desean evaluar su conocimiento de los verbos alemanes.",
  "Learners seeking a quick and efficient way to master all German verbs.": "Estudiantes que buscan una forma rápida y eficiente de dominar todos los verbos alemanes.",
  "Verbs are crucial for passing German exams.": "Los verbos son cruciales para aprobar los exámenes de alemán.",
  "Common errors in using verbs can cause misunderstandings and mistakes.": "Los errores comunes al usar verbos pueden causar malentendidos y errores.",
  "Mastering verbs is key to success in any German language examination. By learning them thoroughly, you will be able to speak and write in German confidently, clearly, and without mistakes. Prepare to impress with your flawless grammar and articulate expression!": "Dominar los verbos es clave para el éxito en cualquier examen de idioma alemán. Al aprenderlos a fondo, podrás hablar y escribir en alemán con confianza, claridad y sin errores. ¡Prepárate para impresionar con tu gramática impecable y expresión articulada!",
  "Connect Wallet": "Conectar Billetera",
  "Certificate": "Certificado",
  "If you can make the test without help of the examples, you can earn a certificate.": "Si puedes hacer el test sin ayuda de los ejemplos, puedes obtener un certificado.",
  "If you can make the test with a performance of 80% and more, you can get a nft.": "Si puedes hacer el test con un rendimiento del 80% o más, puedes obtener un NFT.",
  "Survey": "Encuesta"
}
