{
  "Welcome to Konnektoren": "Witaj w Konnektorach",
  "About this Learning Platform": "O tej platformie edukacyjnej",
  "Please select a language from the dropdown.": "Proszę wybrać język z listy rozwijanej.",
  "Please select a language:": "Proszę wybrać język:",
  "Select Language": "Wybierz język",
  "This platform is dedicated to helping individuals improve their understanding and use of German grammar. Specifically, you can learn about:": "Ta platforma ma na celu pomóc osobom w poprawie ich rozumienia i używania gramatyki niemieckiej. Konkretnie możesz dowiedzieć się o:",
  "Config": "Konfiguracja",
  "Player Profile": "Profil gracza",
  "Use a nickname as your name. It will be used for certificates and displayed on the leaderboard.": "Użyj pseudonimu jako swojego imienia. Będzie on używany do certyfikatów i wyświetlany na liście najlepszych graczy.",
  "Connect your Solana account to receive NFTs as rewards for top players.": "Połącz swoje konto Solana, aby otrzymywać NFT jako nagrody dla najlepszych graczy.",
  "Name (Nickname): ": "Imię (Pseudonim): ",
  "Solana Account: ": "Konto Solana: ",
  "Learning History": "Historia uczenia się",
  "Tests Taken by Type": "Testy według typu",
  "Average Performance by Test Type": "Średnia wydajność według typu testu",
  "Test History": "Historia testów",
  "Leaderboard": "Lista najlepszych graczy",
  "Loading...": "Ładowanie...",
  "Only the top 25% of the leaderboard is shown.": "Wyświetlane są tylko najlepsze 25% listy najlepszych graczy.",
  "Konnektoren": "Konnektory",
  ": Understand how to connect clauses and sentences to improve the flow of your German writing and speaking.": ": Zrozum, jak łączyć zdania i części zdania, aby poprawić płynność swojego pisania i mówienia po niemiecku.",
  "Adjektive": "Przymiotniki",
  ": Dive into the use of adjectives, including those with prepositions, to add detail and depth to your descriptions.": ": Zanurz się w użycie przymiotników, w tym tych z przyimkami, aby dodać szczegółowość i głębię do swoich opisów.",
  "Verben": "Czasowniki",
  ": Master the use of verbs, particularly those with prepositions, to express actions and states more effectively.": ": Opanuj użycie czasowników, szczególnie tych z przyimkami, aby wyrażać działania i stany bardziej efektywnie.",
  "Through interactive tests and comprehensive examples, this platform aims to enhance your German grammar skills, making you more confident in your language abilities.": "Poprzez interaktywne testy i wszechstronne przykłady, ta platforma ma na celu poprawę twoich umiejętności gramatyki niemieckiej, sprawiając, że będziesz bardziej pewny swoich umiejętności językowych.",
  "The Konnektoren examples featured here are derived from the German DTB C1 Course.": "Przykłady Konnektorów prezentowane tutaj pochodzą z niemieckiego kursu DTB C1.",
  "Special thanks to the educators and learners at the IFS Academy for their contributions to the course materials.": "Specjalne podziękowania dla nauczycieli i uczniów w Akademii IFS za ich wkład w materiały kursowe.",
  "Profile": "Profil",
  "History": "Historia",
  "About": "O nas",
  "Congratulations!": "Gratulacje!",
  "Outstanding! You've mastered this topic with excellent results.": "Wybitnie! Opanowałeś ten temat z doskonałymi wynikami.",
  "Excellent job! You're well on your way to becoming an expert.": "Doskonała praca! Jestes już blisko bycia ekspertem.",
  "Very good! Your hard work is paying off.": "Bardzo dobrze! Twoja ciężka praca przynosi efekty.",
  "Good job! Keep studying, and you'll see even more improvement.": "Dobra robota! Kontynuuj naukę, a zobaczysz jeszcze większy postęp.",
  "A solid attempt! Review the materials and try again for a better score.": "Solidna próba! Przejrzyj materiały i spróbuj ponownie, aby uzyskać lepszy wynik.",
  "It looks like this topic is still a bit tough for you. Don't worry, with more practice, you'll get there!": "Wygląda na to, że ten temat wciąż jest trochę trudny dla ciebie. Nie martw się, po więcej praktyki dojdziesz do tego!",
  "Konnektoren are conjunctions that connect two clauses or sentences. They are used to express the relationship between the two clauses or sentences.": "Konnektoren to spójniki, które łączą dwa zdania lub części zdania. Służą one do wyrażania relacji między dwoma zdaniami lub częściami zdania.",
  "There are three types of Konnektoren and two types of exceptions:": "Istnieją trzy rodzaje Konnektorów i dwa rodzaje wyjątków:",
  "Konnektoren mit Nebensatz (Verb am Ende) (= Subjunktionen)": "Konnektory z zdaniem podrzędnym (czasownik na końcu) (= Subjunkcje)",
  "Konnektoren mit Hauptsatz (Position 0) (= Konjunktionen)": "Konnektory z głównym zdaniem (pozycja 0) (= Spójniki)",
  "Konnektoren mit Hauptsatz (Position 1) (= Konjunktionaladverbien)": "Konnektory z głównym zdaniem (pozycja 1) (= Przysłówki spójnikowe)",
  "Konnektoren mit Infinitivgruppe": "Konnektory z grupą bezokolicznikową",
  "Konnektoren mit besonderer Position": "Konnektory z wyjątkową pozycją",
  "Each type of Konnektor has its own set of rules and usage, and mastering them will help you express yourself more clearly and effectively in German.": "Każdy rodzaj Konnektora ma swoje własne zasady i zastosowanie, a ich opanowanie pomoże Ci wyrażać się jasno i skutecznie po niemiecku.",
  "Your Task": "Twoje zadanie",
  "You will be shown a Konnektor and you will have to select the correct group it belongs to. This exercise aims to help you understand the usage and position of different Konnektoren within a sentence.": "Zostanie Ci pokazany Konnektor, a Ty będziesz musiał wybrać do którego poprawnego grupy należy. To ćwiczenie ma na celu pomoc Ci zrozumieć użycie i pozycję różnych Konnektorów w zdaniu.",
  "To successfully complete this task, you should:": "Aby pomyślnie ukończyć to zadanie, powinieneś:",
  "First, find the Konnektor in the given sentence. Most sentences will have two parts, typically separated by a comma.": "Najpierw znajdź Konnektor w danym zdaniu. Większość zdań będzie miała dwie części, zazwyczaj oddzielone przecinkiem.",
  "Identify to which part of the sentence the Konnektor belongs.": "Zidentyfikuj, do której części zdania należy Konnektor.",
  "Next, find the verb in the sentence and analyze its position.": "Następnie znajdź czasownik w zdaniu i przeanalizuj jego pozycję.",
  "Based on the position of the verb and the part of the sentence the Konnektor belongs to, select the correct group of Konnektoren.": "Na podstawie pozycji czasownika i części zdania, do której należy Konnektor, wybierz poprawną grupę Konnektorów.",
  "Words in the parentheses, behind the group name, are meant to help you memorize the rules of the Konnektor and the group to which it belongs.": "Słowa w nawiasach, za nazwą grupy, mają pomóc Ci zapamiętać zasady Konnektora i grupę, do której należy.",
  "By practicing the identification and correct classification of Konnektoren, you will enhance your ability to construct and understand complex German sentences.": "Ćwicząc identyfikację i poprawną klasyfikację Konnektorów, poprawisz swoją zdolność do konstruowania i rozumienia złożonych niemieckich zdań.",
  "Konnektoren: Test Your Knowledge": "Konnektory: Testuj swoją wiedzę",
  "The Konnektoren test mode is designed for learners who want to challenge their understanding of German conjunctions without the need for examples.": "Tryb testowy Konnektorów został zaprojektowany dla uczniów, którzy chcą wyzwać swoje rozumienie niemieckich spójników bez potrzeby przykładów.",
  "Who needs it?": "Kto go potrzebuje?",
  "Individuals looking to assess their knowledge of Konnektoren.": "Osoby poszukujące oceny swojej wiedzy na temat Konnektorów.",
  "Those preparing for a German language exam and wishing to test themselves in advance.": "Osoby przygotowujące się do egzaminu z języka niemieckiego i chcące przetestować się z wyprzedzeniem.",
  "Learners seeking a quick and efficient way to master all Konnektoren.": "Uczniowie poszukujący szybkiego i efektywnego sposobu opanowania wszystkich Konnektorów.",
  "Why do you need it?": "Dlaczego go potrzebujesz?",
  "Konnektoren are crucial for passing German exams.": "Konnektory są kluczowe dla zdawania egzaminów z niemieckiego.",
  "Enhances understanding of the German language.": "Wzmacnia zrozumienie języka niemieckiego.",
  "Common errors in using Konnektoren can cause misunderstandings and mistakes.": "Powszechne błędy w użyciu Konnektorów mogą powodować nieporozumienia i błędy.",
  "It's a fundamental aspect of the language that every learner should master.": "To podstawowy aspekt języka, który każdy uczeń powinien opanować.",
  "Mastering Konnektoren is key to success in any German language examination. By learning them thoroughly, you will be able to speak and write in German confidently, clearly, and without mistakes. Prepare to impress with your flawless grammar and articulate expression!": "Opanowanie Konnektorów jest kluczem do sukcesu w każdym egzaminie z języka niemieckiego. Opanowując je dokładnie, będziesz mógł mówić i pisać po niemiecku z pewnością siebie, jasno i bez błędów. Przygotuj się, aby imponować swoją nieskazitelną gramatyką i wyraźnym wyrażaniem!",
  "Embrace the challenge, elevate your German, and speak with pride. Your journey to German fluency starts now!": "Przyjmij wyzwanie, podnieś swój niemiecki i mów z dumą. Twoja podróż do biegłości w niemieckim zaczyna się teraz!",
  "Adjectives are words that describe or modify another person or thing in the sentence. In German, adjectives can precede the noun they describe, which is known as the attributive position, or they can appear in the predicate, following a form of the verb to be (sein), which is known as the predicative position.": "Przymiotniki to słowa, które opisują lub modyfikują inną osobę lub rzecz w zdaniu. W języku niemieckim przymiotniki mogą poprzedzać rzeczownik, który opisują, co jest znane jako pozycja atrybutywna, lub mogą pojawić się w orzeczeniu, po formie czasownika być (sein), co jest znane jako pozycja orzeczeniowa.",
  "One of the key features of German adjectives is declension. German adjectives change their endings based on the gender, case, and number of the nouns they describe. This declension can seem daunting at first, but it is crucial for the correct sentence structure and meaning.": "Jedną z kluczowych cech niemieckich przymiotników jest deklinacja. Niemieckie przymiotniki zmieniają swoje końcówki w zależności od rodzaju, przypadku i liczby rzeczowników, które opisują. Ta deklinacja może wydawać się na początku przerażająca, ale jest kluczowa dla poprawnej struktury zdania i znaczenia.",
  "There are three types of adjectives in German based on their declension patterns:": "W języku niemieckim istnieją trzy rodzaje przymiotników w oparciu o ich wzorce deklinacji:",
  "Weak declension": "Słaba deklinacja",
  "Strong declension": "Silna deklinacja",
  "Mixed declension": "Mieszana deklinacja",
  "Understanding when to use which declension is essential for mastering German adjectives.": "Zrozumienie, kiedy używać której deklinacji, jest kluczowe dla opanowania niemieckich przymiotników.",
  "You will be presented with sentences where you must identify the correct form of the adjective based on the context of the sentence. This exercise will help you understand the declension of adjectives and how they change to match the nouns they describe.": "Będziesz prezentowany z zdaniami, w których musisz zidentyfikować poprawną formę przymiotnika na podstawie kontekstu zdania. To ćwiczenie pomoże Ci zrozumieć deklinację przymiotników i jak zmieniają się one, aby pasowały do rzeczowników, które opisują.",
  "To successfully complete this task, consider the following steps:": "Aby pomyślnie ukończyć to zadanie, rozważ następujące kroki:",
  "Identify the noun that the adjective describes.": "Zidentyfikuj rzeczownik, który opisuje przymiotnik.",
  "Determine the gender, case, and number of the noun.": "Określ płeć, przypadkową i liczbę rzeczownika.",
  "Select the correct adjective form based on the declension pattern.": "Wybierz poprawną formę przymiotnika na podstawie wzorca deklinacji.",
  "Practicing with a variety of sentences will help you become more comfortable with adjective declension and usage in German.": "Ćwiczenie różnymi zdaniami pomoże Ci poczuć się bardziej komfortowo z deklinacją przymiotników i ich użyciem w niemieckim.",
  "Adjectives: Test Your Knowledge": "Przymiotniki: Testuj swoją wiedzę",
  "Challenge your understanding of German adjectives with this test mode, designed for learners seeking to assess and improve their adjective usage.": "Wyzwij swoje zrozumienie niemieckich przymiotników tym trybem testowym, zaprojektowanym dla uczniów, którzy chcą ocenić i poprawić swoje użycie przymiotników.",
  "Why it's beneficial:": "Dlaczego jest to korzystne:",
  "Assess your knowledge of adjective declension and placement.": "Oceń swoją wiedzę na temat deklinacji i umiejscowienia przymiotników.",
  "Identify areas for improvement in adjective usage.": "Zidentyfikuj obszary do poprawy w użyciu przymiotników.",
  "Prepare for German language exams with focused practice.": "Przygotuj się do egzaminów z języka niemieckiego z koncentrowaną praktyką.",
  "Mastering adjectives is essential for expressing detailed and accurate descriptions in German. Take this opportunity to strengthen your skills and build confidence in your German language abilities.": "Opanowanie przymiotników jest kluczowe dla wyrażania szczegółowych i dokładnych opisów po niemiecku. Skorzystaj z tej okazji, aby wzmocnić swoje umiejętności i zbudować pewność siebie w zakresie umiejętności języka niemieckiego.",
  "Dive into the challenge and emerge with a deeper understanding of German adjectives. Your path to German fluency is enriched with every step forward!": "Zanurz się w wyzwaniu i wyjdź z głębszym zrozumieniem niemieckich przymiotników. Twoja droga do biegłości w niemieckim jest wzbogacona o każdy kolejny krok!",
  "Verbs are the most important part of any sentence. They are the action words that express what the subject is doing. In German, verbs are conjugated to match the subject of the sentence, and they can be used in different tenses and moods.": "Czasowniki są najważniejszą częścią każdego zdania. Są to słowa czynności, które wyrażają to, co robi podmiot. W języku niemieckim czasowniki są odmieniane, aby pasować do podmiotu zdania, i mogą być używane w różnych czasach i trybach.",
  "There are three types of verbs in German:": "W języku niemieckim istnieją trzy rodzaje czasowników:",
  "Regular verbs": "Regularne czasowniki",
  "Irregular verbs": "Nieregularne czasowniki",
  "Modal verbs": "Czasowniki modalne",
  "Each type of verb has its own set of rules and usage, and mastering them will help you express yourself more clearly and effectively in German.": "Każdy rodzaj czasownika ma swoje własne zasady i zastosowanie, a opanowanie ich pomoże Ci wyrażać się jasniej i skuteczniej po niemiecku.",
  "By practicing the identification and correct classification of verbs, you will enhance your ability to construct and understand complex German sentences.": "Poprzez praktykę identyfikacji i poprawnej klasyfikacji czasowników, zwiększysz swoją zdolność do konstruowania i rozumienia skomplikowanych zdań po niemiecku.",
  "Verben: Test Your Knowledge": "Czasowniki: Testuj swoją wiedzę",
  "The Verben test mode is designed for learners who want to challenge their understanding of German verbs without the need for examples.": "Tryb testowy Czasowniki jest przeznaczony dla uczniów, którzy chcą wyzwać swoje rozumienie niemieckich czasowników bez potrzeby przykładów.",
  "Individuals looking to assess their knowledge of German verbs.": "Osoby szukające oceny swojej wiedzy na temat niemieckich czasowników.",
  "Learners seeking a quick and efficient way to master all German verbs.": "Uczący się szukający szybkiego i efektywnego sposobu opanowania wszystkich niemieckich czasowników.",
  "Verbs are crucial for passing German exams.": "Czasowniki są kluczowe dla zdawania niemieckich egzaminów.",
  "Common errors in using verbs can cause misunderstandings and mistakes.": "Powszechne błędy w użyciu czasowników mogą powodować nieporozumienia i błędy.",
  "Mastering verbs is key to success in any German language examination. By learning them thoroughly, you will be able to speak and write in German confidently, clearly, and without mistakes. Prepare to impress with your flawless grammar and articulate expression!": "Opanowanie czasowników jest kluczem do sukcesu na każdym egzaminie z języka niemieckiego. Poprzez ich gruntowne naukę będziesz mógł mówić i pisać po niemiecku pewnie, jasno i bez błędów. Przygotuj się, aby imponować swoją nieskazitelną gramatyką i wyraźnym wyrażaniem!",
  "Connect Wallet": "Połącz portfel",
  "Certificate": "Certyfikat",
  "If you can make the test without help of the examples, you can earn a certificate.": "Jeśli możesz zdać test bez pomocy przykładów, możesz otrzymać certyfikat.",
  "If you can make the test with a performance of 80% and more, you can get a nft.": "Jeśli możesz zdać test ze wynikiem 80% i więcej, możesz otrzymać NFT.",
  "Survey": "Ankieta"
}
