{
  "Welcome to Konnektoren": "Ласкаво просимо до Konnektoren",
  "About this Learning Platform": "Про цю навчальну платформу",
  "Please select a language from the dropdown.": "Будь ласка, виберіть мову з випадаючого списку.",
  "Select Language": "Виберіть мову",
  "This platform is dedicated to helping individuals improve their understanding and use of German grammar. Specifically, you can learn about:": "Ця платформа присвячена допомозі людям покращити розуміння та використання німецької граматики. Зокрема, ви можете дізнатися про:",
  "Config": "Конфігурація",
  "Player Profile": "Профіль гравця",
  "Use a nickname as your name. It will be used for certificates and displayed on the leaderboard.": "Використовуйте псевдонім як своє ім'я. Він буде використовуватись для сертифікатів та відображатися на таблиці лідерів.",
  "Connect your Solana account to receive NFTs as rewards for top players.": "Підключіть свій обліковий запис Solana, щоб отримувати NFT як винагороду для кращих гравців.",
  "Name (Nickname): ": "Ім'я (Нікнейм): ",
  "Solana Account: ": "Обліковий запис Solana: ",
  "Konnektoren": "Коннектори",
  ": Understand how to connect clauses and sentences to improve the flow of your German writing and speaking.": ": Зрозумійте, як з'єднувати частини речень та речення, щоб покращити плинність вашого письма та мовлення німецькою.",
  "Adjektive": "Прикметники",
  ": Dive into the use of adjectives, including those with prepositions, to add detail and depth to your descriptions.": ": Поглиблено вивчіть використання прикметників, включно з тими, що з прийменниками, для додання деталей та глибини вашим описам.",
  "Verben": "Дієслова",
  ": Master the use of verbs, particularly those with prepositions, to express actions and states more effectively.": ": Опануйте використання дієслів, особливо тих, що з прийменниками, для більш ефективного вираження дій та станів.",
  "Through interactive tests and comprehensive examples, this platform aims to enhance your German grammar skills, making you more confident in your language abilities.": "За допомогою інтерактивних тестів та всебічних прикладів ця платформа має на меті покращити ваші навички німецької граматики, роблячи вас більш впевненими у своїх мовних здібностях.",
  "The Konnektoren examples featured here are derived from the German DTB C1 Course.": "Приклади коннекторів, представлені тут, походять з німецького курсу DTB C1.",
  "Special thanks to the educators and learners at the IFS Academy for their contributions to the course materials.": "Особлива подяка викладачам та учням академії IFS за їх внесок у навчальні матеріали."
}
