{
  "Welcome to Konnektoren": "Ласкаво просимо до Коннекторів",
  "About this Learning Platform": "Про цю навчальну платформу",
  "Please select a language from the dropdown.": "Будь ласка, виберіть мову з випадаючого списку.",
  "Please select a language:": "Будь ласка, виберіть мову:",
  "Select Language": "Вибрати мову",
  "This platform is dedicated to helping individuals improve their understanding and use of German grammar. Specifically, you can learn about:": "Ця платформа призначена для допомоги людям у покращенні їхнього розуміння та використання німецької граматики. Зокрема, ви можете дізнатися про:",
  "Config": "Налаштування",
  "Player Profile": "Профіль гравця",
  "Use a nickname as your name. It will be used for certificates and displayed on the leaderboard.": "Використовуйте псевдонім як ваше ім'я. Він буде використовуватися для сертифікатів і відображатися в таблиці лідерів.",
  "Connect your Solana account to receive NFTs as rewards for top players.": "Підключіть ваш Solana акаунт, щоб отримувати NFT як нагороди для кращих гравців.",
  "Name (Nickname): ": "Ім'я (Нікнейм): ",
  "Solana Account: ": "Акаунт Solana: ",
  "Learning History": "Історія Навчання",
  "Tests Taken by Type": "Тести, Взяті за Типом",
  "Average Performance by Test Type": "Середній Результат за Типом Тесту",
  "Test History": "Історія Тестів",
  "Leaderboard": "Таблиця Лідерів",
  "Loading...": "Завантаження...",
  "Only the top 25% of the leaderboard is shown.": "Показано лише верхній 25% таблиці лідерів.",
  "Konnektoren": "Коннектори",
  ": Understand how to connect clauses and sentences to improve the flow of your German writing and speaking.": ": Розумійте, як з'єднувати пропозиції та речення, щоб покращити потік вашого німецького письма та мовлення.",
  "Adjektive": "Прикметники",
  ": Dive into the use of adjectives, including those with prepositions, to add detail and depth to your descriptions.": ": Зануртеся у використання прикметників, включаючи ті, що з прийменниками, для додавання деталей та глибини до ваших описів.",
  "Verben": "Дієслова",
  ": Master the use of verbs, particularly those with prepositions, to express actions and states more effectively.": ": Опануйте використання дієслів, зокрема тих, що з прийменниками, щоб ефективніше виражати дії та стани.",
  "Through interactive tests and comprehensive examples, this platform aims to enhance your German grammar skills, making you more confident in your language abilities.": "За допомогою інтерактивних тестів та комплексних прикладів ця платформа має на меті покращити ваші навички німецької граматики, роблячи вас більш впевненими у своїх мовних здібностях.",
  "The Konnektoren examples featured here are derived from the German DTB C1 Course.": "Приклади коннекторів, представлені тут, взяті з німецького курсу DTB C1.",
  "Special thanks to the educators and learners at the IFS Academy for their contributions to the course materials.": "Особлива подяка викладачам та учням академії IFS за їх внесок у навчальні матеріали.",
  "Profile": "Профіль",
  "History": "Історія",
  "About": "Про",
  "Congratulations!": "Вітання!",
  "Outstanding! You've mastered this topic with excellent results.": "Видатно! Ви освоїли цю тему з відмінними результатами.",
  "Excellent job! You're well on your way to becoming an expert.": "Чудова робота! Ви на правильному шляху до становлення експертом.",
  "Very good! Your hard work is paying off.": "Дуже добре! Ваша наполеглива праця приносить результати.",
  "Good job! Keep studying, and you'll see even more improvement.": "Гарна робота! Продовжуйте вчитися, і ви побачите ще більше поліпшень.",
  "A solid attempt! Review the materials and try again for a better score.": "Солідна спроба! Перегляньте матеріали та спробуйте знову для кращого результату.",
  "It looks like this topic is still a bit tough for you. Don't worry, with more practice, you'll get there!": "Здається, ця тема все ще трохи важка для вас. Не хвилюйтеся, з більшою практикою ви досягнете успіху!",
  "Konnektoren are conjunctions that connect two clauses or sentences. They are used to express the relationship between the two clauses or sentences.": "Коннектори - це сполучники, що з'єднують дві частини речення або речення. Вони використовуються для вираження відносин між двома частинами речення або реченнями.",
  "There are three types of Konnektoren and two types of exceptions:": "Існують три типи коннекторів та два типи винятків:",
  "Konnektoren mit Nebensatz (Verb am Ende) (= Subjunktionen)": "Коннектори з підрядним реченням (дієслово в кінці) (= Суб'юнкції)",
  "Konnektoren mit Hauptsatz (Position 0) (= Konjunktionen)": "Коннектори з головним реченням (Позиція 0) (= Кон'юнкції)",
  "Konnektoren mit Hauptsatz (Position 1) (= Konjunktionaladverbien)": "Коннектори з головним реченням (Позиція 1) (= Кон'юнкціональні прислівники)",
  "Konnektoren mit Infinitivgruppe": "Коннектори з інфінітивною групою",
  "Konnektoren mit besonderer Position": "Коннектори з особливою позицією",
  "Each type of Konnektor has its own set of rules and usage, and mastering them will help you express yourself more clearly and effectively in German.": "Кожен тип коннектора має свій набір правил та використання, і їх освоєння допоможе вам виражати себе більш чітко та ефективно німецькою мовою.",
  "Your Task": "Ваше завдання",
  "You will be shown a Konnektor and you will have to select the correct group it belongs to. This exercise aims to help you understand the usage and position of different Konnektoren within a sentence.": "Вам буде показано коннектор, і вам доведеться вибрати правильну групу, до якої він належить. Це вправа має на меті допомогти вам зрозуміти використання та позицію різних коннекторів у реченні.",
  "To successfully complete this task, you should:": "Щоб успішно виконати це завдання, ви повинні:",
  "First, find the Konnektor in the given sentence. Most sentences will have two parts, typically separated by a comma.": "Спочатку знайдіть коннектор у даному реченні. Більшість речень матимуть дві частини, як правило, розділені комою.",
  "Identify to which part of the sentence the Konnektor belongs.": "Визначте, до якої частини речення належить коннектор.",
  "Next, find the verb in the sentence and analyze its position.": "Далі знайдіть дієслово в реченні та проаналізуйте його позицію.",
  "Based on the position of the verb and the part of the sentence the Konnektor belongs to, select the correct group of Konnektoren.": "На основі позиції дієслова та частини речення, до якої належить коннектор, виберіть правильну групу коннекторів.",
  "Words in the parentheses, behind the group name, are meant to help you memorize the rules of the Konnektor and the group to which it belongs.": "Слова в дужках, за назвою групи, призначені допомогти вам запам'ятати правила коннектора та групи, до якої він належить.",
  "By practicing the identification and correct classification of Konnektoren, you will enhance your ability to construct and understand complex German sentences.": "Практикуючи ідентифікацію та правильну класифікацію коннекторів, ви покращите свою здатність будувати та розуміти складні німецькі речення.",
  "Konnektoren: Test Your Knowledge": "Коннектори: Перевірте свої знання",
  "The Konnektoren test mode is designed for learners who want to challenge their understanding of German conjunctions without the need for examples.": "Тестовий режим Konnektoren призначений для учнів, які хочуть перевірити своє розуміння німецьких сполучників без потреби у прикладах.",
  "Who needs it?": "Кому це потрібно?",
  "Individuals looking to assess their knowledge of Konnektoren.": "Особи, які хочуть оцінити свої знання коннекторів.",
  "Those preparing for a German language exam and wishing to test themselves in advance.": "Ті, хто готується до іспиту з німецької мови і хоче заздалегідь протестувати себе.",
  "Learners seeking a quick and efficient way to master all Konnektoren.": "Учні, які шукають швидкий і ефективний спосіб оволодіти всіма коннекторами.",
  "Why do you need it?": "Чому вам це потрібно?",
  "Konnektoren are crucial for passing German exams.": "Коннектори є вирішальними для складання німецьких іспитів.",
  "Enhances understanding of the German language.": "Покращує розуміння німецької мови.",
  "Common errors in using Konnektoren can cause misunderstandings and mistakes.": "Поширені помилки у використанні коннекторів можуть призвести до непорозумінь і помилок.",
  "It's a fundamental aspect of the language that every learner should master.": "Це фундаментальний аспект мови, який кожен учень повинен оволодіти.",
  "Mastering Konnektoren is key to success in any German language examination. By learning them thoroughly, you will be able to speak and write in German confidently, clearly, and without mistakes. Prepare to impress with your flawless grammar and articulate expression!": "Оволодіння коннекторами є ключем до успіху в будь-якому іспиті з німецької мови. Вивчивши їх ретельно, ви зможете впевнено, чітко і без помилок говорити та писати німецькою мовою. Підготуйтеся вразити своєю бездоганною граматикою та артикульованою виразністю!",
  "Embrace the challenge, elevate your German, and speak with pride. Your journey to German fluency starts now!": "Прийміть виклик, підніміть свою німецьку на новий рівень і говоріть з гордістю. Ваш шлях до вільного володіння німецькою починається зараз!",
  "Adjectives are words that describe or modify another person or thing in the sentence. In German, adjectives can precede the noun they describe, which is known as the attributive position, or they can appear in the predicate, following a form of the verb to be (sein), which is known as the predicative position.": "Прикметники - це слова, які описують або змінюють іншу особу або річ у реченні. Німецькі прикметники можуть передувати іменнику, який вони описують, що відомо як атрибутивна позиція, або вони можуть з'явитися в присудковому, слідуючи за формою дієслова бути (sein), що відомо як присудкова позиція.",
  "One of the key features of German adjectives is declension. German adjectives change their endings based on the gender, case, and number of the nouns they describe. This declension can seem daunting at first, but it is crucial for the correct sentence structure and meaning.": "Однією з ключових особливостей німецьких прикметників є відмінювання. Німецькі прикметники змінюють свої закінчення в залежності від роду, відмінка та числа іменників, які вони описують. Це відмінювання може здатися спочатку лякаючим, але воно вирішальне для правильної структури речення та його значення.",
  "There are three types of adjectives in German based on their declension patterns:": "Є три типи прикметників німецькою мовою на основі їх відмінювання:",
  "Weak declension": "Слабке відмінювання",
  "Strong declension": "Сильне відмінювання",
  "Mixed declension": "Змішане відмінювання",
  "Understanding when to use which declension is essential for mastering German adjectives.": "Розуміння того, коли використовувати яке відмінювання, є вирішальним для оволодіння німецькими прикметниками.",
  "You will be presented with sentences where you must identify the correct form of the adjective based on the context of the sentence. This exercise will help you understand the declension of adjectives and how they change to match the nouns they describe.": "Вам будуть представлені речення, де ви повинні визначити правильну форму прикметника на основі контексту речення. Ця вправа допоможе вам зрозуміти відмінювання прикметників та те, як вони змінюються, щоб відповідати іменникам, які вони описують.",
  "To successfully complete this task, consider the following steps:": "Щоб успішно виконати це завдання, розгляньте наступні кроки:",
  "Identify the noun that the adjective describes.": "Визначте іменник, який описує прикметник.",
  "Determine the gender, case, and number of the noun.": "Визначте рід, відмінок та число іменника.",
  "Select the correct adjective form based on the declension pattern.": "Виберіть правильну форму прикметника на основі відмінювання.",
  "Practicing with a variety of sentences will help you become more comfortable with adjective declension and usage in German.": "Практика з різноманітними реченнями допоможе вам стати більш комфортними з відмінюванням та використанням прикметників німецькою мовою.",
  "Adjectives: Test Your Knowledge": "Прикметники: Перевірте свої знання",
  "Challenge your understanding of German adjectives with this test mode, designed for learners seeking to assess and improve their adjective usage.": "Випробуйте своє розуміння німецьких прикметників у цьому тестовому режимі, призначеному для учнів, які хочуть оцінити та покращити своє використання прикметників.",
  "Why it's beneficial:": "Чому це корисно:",
  "Assess your knowledge of adjective declension and placement.": "Оцініть свої знання відмінювання та розміщення прикметників.",
  "Identify areas for improvement in adjective usage.": "Визначте області для покращення в використанні прикметників.",
  "Prepare for German language exams with focused practice.": "Підготуйтеся до іспитів з німецької мови з фокусованою практикою.",
  "Mastering adjectives is essential for expressing detailed and accurate descriptions in German. Take this opportunity to strengthen your skills and build confidence in your German language abilities.": "Оволодіння прикметниками є вирішальним для вираження детальних та точних описів німецькою мовою. Скористайтеся цією можливістю, щоб підсилити свої навички та підвищити впевненість у своїх мовних здібностях.",
  "Dive into the challenge and emerge with a deeper understanding of German adjectives. Your path to German fluency is enriched with every step forward!": "Зануртесь у виклик і вийдіть з глибшим розумінням німецьких прикметників. Ваш шлях до вільного володіння німецькою мовою збагачується кожним кроком вперед!",
  "Verbs are the most important part of any sentence. They are the action words that express what the subject is doing. In German, verbs are conjugated to match the subject of the sentence, and they can be used in different tenses and moods.": "Дієслова - це найважливіша частина будь-якого речення. Вони є дієсловами, які виражають, що робить підмет. Німецькі дієслова відмінюються, щоб відповідати підмету речення, і їх можна використовувати в різних часах та способах.",
  "There are three types of verbs in German:": "Є три типи дієслів німецькою мовою:",
  "Regular verbs": "Регулярні дієслова",
  "Irregular verbs": "Неправильні дієслова",
  "Modal verbs": "Модальні дієслова",
  "Each type of verb has its own set of rules and usage, and mastering them will help you express yourself more clearly and effectively in German.": "Кожен тип дієслова має свій набір правил та використання, і їх освоєння допоможе вам виражати себе більш чітко та ефективно німецькою мовою.",
  "By practicing the identification and correct classification of verbs, you will enhance your ability to construct and understand complex German sentences.": "Практикуючи ідентифікацію та правильну класифікацію дієслів, ви покращите свою здатність будувати та розуміти складні німецькі речення.",
  "Verben: Test Your Knowledge": "Дієслова: Перевірте свої знання",
  "The Verben test mode is designed for learners who want to challenge their understanding of German verbs without the need for examples.": "Тестовий режим Verben призначений для учнів, які хочуть перевірити своє розуміння німецьких дієслів без потреби у прикладах.",
  "Individuals looking to assess their knowledge of German verbs.": "Особи, які хочуть оцінити свої знання німецьких дієслів.",
  "Learners seeking a quick and efficient way to master all German verbs.": "Учні, які шукають швидкий і ефективний спосіб оволодіти всіма німецькими дієсловами.",
  "Verbs are crucial for passing German exams.": "Дієслова є вирішальними для складання німецьких іспитів.",
  "Common errors in using verbs can cause misunderstandings and mistakes.": "Поширені помилки у використанні дієслів можуть призвести до непорозумінь і помилок.",
  "Mastering verbs is key to success in any German language examination. By learning them thoroughly, you will be able to speak and write in German confidently, clearly, and without mistakes. Prepare to impress with your flawless grammar and articulate expression!": "Оволодіння дієсловами є ключем до успіху в будь-якому іспиті з німецької мови. Вивчивши їх ретельно, ви зможете впевнено, чітко і без помилок говорити та писати німецькою мовою. Підготуйтеся вразити своєю бездоганною граматикою та артикульованою виразністю!",
  "Connect Wallet": "Підключити Гаманець",
  "Certificate": "Сертифікат",
  "If you can make the test without help of the examples, you can earn a certificate.": "Якщо ви можете пройти тест без допомоги прикладів, ви можете отримати сертифікат.",
  "If you can make the test with a performance of 80% and more, you can get a nft.": "Якщо ви можете пройти тест з результатом 80% і більше, ви можете отримати nft."
}
