{
  "Welcome to Konnektoren": "Ласкаво просимо до Konnektoren",
  "About this Learning Platform": "Про цю навчальну платформу",
  "Please select a language from the dropdown.": "Будь ласка, виберіть мову з випадаючого списку.",
  "Select Language": "Виберіть мову",
  "This platform is dedicated to helping individuals improve their understanding and use of German grammar. Specifically, you can learn about:": "Ця платформа призначена для допомоги особам у покращенні їх розуміння та використання німецької граматики. Зокрема, ви можете дізнатися про:",
  "Config": "Конфіг",
  "Player Profile": "Профіль гравця",
  "Use a nickname as your name. It will be used for certificates and displayed on the leaderboard.": "Використовуйте псевдонім як своє ім'я. Він буде використовуватися для сертифікатів та відображатися на дошці лідерів.",
  "Connect your Solana account to receive NFTs as rewards for top players.": "Підключіть свій обліковий запис Solana, щоб отримувати NFT-токени як винагороду для кращих гравців.",
  "Name (Nickname): ": "Name (Nickname): ",
  "Solana Account: " : "Solana Account: ",
  "Konnektoren": "Konnektoren",
  ": Understand how to connect clauses and sentences to improve the flow of your German writing and speaking.": ": Understand how to connect clauses and sentences to improve the flow of your German writing and speaking.",
  "Adjektive": "Adjektive",
  ": Dive into the use of adjectives, including those with prepositions, to add detail and depth to your descriptions.": ": Dive into the use of adjectives, including those with prepositions, to add detail and depth to your descriptions.",
  "Verben": "Verben",
  ": Master the use of verbs, particularly those with prepositions, to express actions and states more effectively.": ": Master the use of verbs, particularly those with prepositions, to express actions and states more effectively.",
  "Through interactive tests and comprehensive examples, this platform aims to enhance your German grammar skills, making you more confident in your language abilities.": "Through interactive tests and comprehensive examples, this platform aims to enhance your German grammar skills, making you more confident in your language abilities.",
  "The Konnektoren examples featured here are derived from the German DTB C1 Course.": "The Konnektoren examples featured here are derived from the German DTB C1 Course.",
  "Special thanks to the educators and learners at the IFS Academy for their contributions to the course materials.": "Special thanks to the educators and learners at the IFS Academy for their contributions to the course materials."
}
