{
  "Welcome to Konnektoren": "Willkommen bei den Konnektoren",
  "About this Learning Platform": "Über diese Lernplattform",
  "Please select a language from the dropdown.": "Bitte wählen Sie eine Sprache aus dem Dropdown-Menü.",
  "Select Language": "Sprache wählen",
  "This platform is dedicated to helping individuals improve their understanding and use of German grammar. Specifically, you can learn about:": "Diese Plattform ist darauf ausgerichtet, Einzelpersonen zu helfen, ihr Verständnis und ihre Nutzung der deutschen Grammatik zu verbessern. Insbesondere können Sie hierüber lernen:",
  "Config": "Konfiguration",
  "Player Profile": "Spielerprofil",
  "Use a nickname as your name. It will be used for certificates and displayed on the leaderboard.": "Verwenden Sie einen Spitznamen als Ihren Namen. Er wird für Zertifikate verwendet und auf der Bestenliste angezeigt.",
  "Connect your Solana account to receive NFTs as rewards for top players.": "Verbinden Sie Ihr Solana-Konto, um NFTs als Belohnungen für Top-Spieler zu erhalten.",
  "Name (Nickname): ": "Name (Spitzname): ",
  "Solana Account: ": "Solana-Konto: ",
  "Learning History": "Lerngeschichte",
  "Tests Taken by Type": "Tests nach Typ",
  "Average Performance by Test Type": "Durchschnittliche Leistung nach Testtyp",
  "Test History": "Testhistorie",
  "Leaderboard": "Bestenliste",
  "Loading...": "Laden...",
  "Konnektoren": "Konnektoren",
  ": Understand how to connect clauses and sentences to improve the flow of your German writing and speaking.": ": Verstehen, wie man Satzteile und Sätze verbindet, um den Fluss Ihres deutschen Schreibens und Sprechens zu verbessern.",
  "Adjektive": "Adjektive",
  ": Dive into the use of adjectives, including those with prepositions, to add detail and depth to your descriptions.": ": Tauchen Sie ein in die Verwendung von Adjektiven, einschließlich solcher mit Präpositionen, um Ihren Beschreibungen Details und Tiefe zu verleihen.",
  "Verben": "Verben",
  ": Master the use of verbs, particularly those with prepositions, to express actions and states more effectively.": ": Beherrschen Sie die Verwendung von Verben, insbesondere solchen mit Präpositionen, um Handlungen und Zustände effektiver auszudrücken.",
  "Through interactive tests and comprehensive examples, this platform aims to enhance your German grammar skills, making you more confident in your language abilities.": "Durch interaktive Tests und umfassende Beispiele zielt diese Plattform darauf ab, Ihre deutschen Grammatikkenntnisse zu verbessern und Sie sicherer in Ihren Sprachfähigkeiten zu machen.",
  "The Konnektoren examples featured here are derived from the German DTB C1 Course.": "Die hier vorgestellten Konnektoren-Beispiele stammen aus dem deutschen DTB C1-Kurs.",
  "Special thanks to the educators and learners at the IFS Academy for their contributions to the course materials.": "Ein besonderer Dank gilt den Lehrkräften und Lernenden der IFS Academy für ihre Beiträge zu den Kursmaterialien.",
  "Profile": "Profil",
  "History": "Geschichte",
  "Leaderboard": "Bestenliste",
  "About": "Über",
  "Congratulations!": "Herzlichen Glückwunsch!",
  "Outstanding! You've mastered this topic with excellent results.": "Hervorragend! Sie haben dieses Thema mit ausgezeichneten Ergebnissen gemeistert.",
  "Excellent job! You're well on your way to becoming an expert.": "Ausgezeichnete Arbeit! Sie sind auf dem besten Weg, ein Experte zu werden.",
  "Very good! Your hard work is paying off.": "Sehr gut! Ihre harte Arbeit zahlt sich aus.",
  "Good job! Keep studying, and you'll see even more improvement.": "Gute Arbeit! Weiter so, und Sie werden noch weitere Verbesserungen sehen.",
  "A solid attempt! Review the materials and try again for a better score.": "Ein solider Versuch! Gehen Sie das Material durch und versuchen Sie es erneut für eine bessere Punktzahl.",
  "It looks like this topic is still a bit tough for you. Don't worry, with more practice, you'll get there!": "Es scheint, als wäre dieses Thema noch etwas schwierig für Sie. Keine Sorge, mit mehr Übung werden Sie es schaffen!",
  "Konnektoren are conjunctions that connect two clauses or sentences. They are used to express the relationship between the two clauses or sentences.": "Konnektoren sind Konjunktionen, die zwei Teilsätze oder Sätze verbinden. Sie werden verwendet, um die Beziehung zwischen den beiden Teilsätzen oder Sätzen auszudrücken.",
  "There are three types of Konnektoren and two types of exceptions:": "Es gibt drei Arten von Konnektoren und zwei Arten von Ausnahmen:",
  "Konnektoren mit Nebensatz (Verb am Ende) (= Subjunktionen)": "Konnektoren mit Nebensatz (Verb am Ende) (= Subjunktionen)",
  "Konnektoren mit Hauptsatz (Position 0) (= Konjunktionen)": "Konnektoren mit Hauptsatz (Position 0) (= Konjunktionen)",
  "Konnektoren mit Hauptsatz (Position 1) (= Konjunktionaladverbien)": "Konnektoren mit Hauptsatz (Position 1) (= Konjunktionaladverbien)",
  "Konnektoren mit Infinitivgruppe": "Konnektoren mit Infinitivgruppe",
  "Konnektoren mit besonderer Position": "Konnektoren mit besonderer Position",
  "Each type of Konnektor has its own set of rules and usage, and mastering them will help you express yourself more clearly and effectively in German.": "Jeder Typ von Konnektor hat seinen eigenen Satz an Regeln und Verwendungen, und sie zu beherrschen, hilft Ihnen, sich klarer und effektiver auf Deutsch auszudrücken.",
  "Your Task": "Ihre Aufgabe",
  "You will be shown a Konnektor and you will have to select the correct group it belongs to. This exercise aims to help you understand the usage and position of different Konnektoren within a sentence.": "Es wird Ihnen ein Konnektor gezeigt, und Sie müssen die richtige Gruppe auswählen, zu der er gehört. Diese Übung soll Ihnen helfen, den Gebrauch und die Position verschiedener Konnektoren in einem Satz zu verstehen.",
  "To successfully complete this task, you should:": "Um diese Aufgabe erfolgreich zu absolvieren, sollten Sie:",
  "First, find the Konnektor in the given sentence. Most sentences will have two parts, typically separated by a comma.": "Finden Sie zunächst den Konnektor im gegebenen Satz. Die meisten Sätze haben zwei Teile, die in der Regel durch ein Komma getrennt sind.",
  "Identify to which part of the sentence the Konnektor belongs.": "Identifizieren Sie, zu welchem Teil des Satzes der Konnektor gehört.",
  "Next, find the verb in the sentence and analyze its position.": "Finden Sie als Nächstes das Verb im Satz und analysieren Sie seine Position.",
  "Based on the position of the verb and the part of the sentence the Konnektor belongs to, select the correct group of Konnektoren.": "Wählen Sie basierend auf der Position des Verbs und des Teils des Satzes, zu dem der Konnektor gehört, die richtige Gruppe von Konnektoren aus.",
  "Words in the parentheses, behind the group name, are meant to help you memorize the rules of the Konnektor and the group to which it belongs.": "Die Wörter in Klammern hinter dem Gruppennamen sollen Ihnen helfen, sich die Regeln des Konnektors und die Gruppe, zu der er gehört, zu merken.",
  "By practicing the identification and correct classification of Konnektoren, you will enhance your ability to construct and understand complex German sentences.": "Durch das Üben der Identifikation und korrekten Klassifizierung von Konnektoren verbessern Sie Ihre Fähigkeit, komplexe deutsche Sätze zu konstruieren und zu verstehen.",
  "Konnektoren: Test Your Knowledge": "Konnektoren: Testen Sie Ihr Wissen",
  "The Konnektoren test mode is designed for learners who want to challenge their understanding of German conjunctions without the need for examples.": "Der Testmodus für Konnektoren ist für Lernende konzipiert, die ihr Verständnis deutscher Konjunktionen ohne die Notwendigkeit von Beispielen herausfordern möchten.",
  "Who needs it?": "Wer braucht es?",
  "Individuals looking to assess their knowledge of Konnektoren.": "Personen, die ihr Wissen über Konnektoren bewerten möchten.",
  "Those preparing for a German language exam and wishing to test themselves in advance.": "Diejenigen, die sich auf eine deutsche Sprachprüfung vorbereiten und sich im Voraus testen möchten.",
  "Learners seeking a quick and efficient way to master all Konnektoren.": "Lernende, die einen schnellen und effizienten Weg suchen, um alle Konnektoren zu meistern.",
  "Why do you need it?": "Warum brauchen Sie es?",
  "Konnektoren are crucial for passing German exams.": "Konnektoren sind entscheidend für das Bestehen deutscher Prüfungen.",
  "Enhances understanding of the German language.": "Verbessert das Verständnis der deutschen Sprache.",
  "Common errors in using Konnektoren can cause misunderstandings and mistakes.": "Häufige Fehler beim Gebrauch von Konnektoren können zu Missverständnissen und Fehlern führen.",
  "It's a fundamental aspect of the language that every learner should master.": "Es ist ein grundlegender Aspekt der Sprache, den jeder Lernende beherrschen sollte.",
  "Mastering Konnektoren is key to success in any German language examination. By learning them thoroughly, you will be able to speak and write in German confidently, clearly, and without mistakes. Prepare to impress with your flawless grammar and articulate expression!": "Das Beherrschen von Konnektoren ist der Schlüssel zum Erfolg in jeder deutschen Sprachprüfung. Indem Sie sie gründlich lernen, werden Sie in der Lage sein, selbstbewusst, klar und ohne Fehler auf Deutsch zu sprechen und zu schreiben. Bereiten Sie sich darauf vor, mit Ihrer einwandfreien Grammatik und ausdrucksstarken Ausdrucksweise zu beeindrucken!",
  "Embrace the challenge, elevate your German, and speak with pride. Your journey to German fluency starts now!": "Nehmen Sie die Herausforderung an, verbessern Sie Ihr Deutsch und sprechen Sie mit Stolz. Ihre Reise zur fließenden Beherrschung der deutschen Sprache beginnt jetzt!",
  "Connect Wallet": "Wallet verbinden"
}
