{
  "Welcome to Konnektoren": "Willkommen auf Konnektoren",
  "About this Learning Platform": "Über diese Lernplattform",
  "Please select a language from the dropdown.": "Bitte wählen Sie eine Sprache aus der Dropdown-Liste aus.",
  "Select Language": "Sprache auswählen",
  "This platform is dedicated to helping individuals improve their understanding and use of German grammar. Specifically, you can learn about:": "Diese Plattform ist darauf ausgerichtet, Einzelpersonen zu helfen, ihr Verständnis und ihre Anwendung der deutschen Grammatik zu verbessern. Insbesondere können Sie lernen über:",
  "Config": "Konfiguration",
  "Player Profile": "Spielerprofil",
  "Use a nickname as your name. It will be used for certificates and displayed on the leaderboard.": "Verwenden Sie einen Spitznamen als Ihren Namen. Er wird für Zertifikate verwendet und auf der Bestenliste angezeigt.",
  "Connect your Solana account to receive NFTs as rewards for top players.": "Verbinden Sie Ihr Solana-Konto, um NFTs als Belohnungen für die besten Spieler zu erhalten.",
  "Name (Nickname): ": "Name (Spitzname): ",
  "Solana Account: ": "Solana-Konto: ",
  "Learning History" : "Learning History",
  "Tests Taken by Type" : "Tests Taken by Type",
  "Average Performance by Test Type" : "Average Performance by Test Type",
  "Test History" : "Test History",
  "Leaderboard": "Leaderboard",
  "Loading..." : "Loading...",
  "Konnektoren": "Konnektoren",
  ": Understand how to connect clauses and sentences to improve the flow of your German writing and speaking.": ": Verstehen Sie, wie Sie Klauseln und Sätze verbinden können, um den Fluss Ihres deutschen Schreibens und Sprechens zu verbessern.",
  "Adjektive": "Adjektive",
  ": Dive into the use of adjectives, including those with prepositions, to add detail and depth to your descriptions.": ": Tauchen Sie ein in die Verwendung von Adjektiven, einschließlich derer mit Präpositionen, um Ihren Beschreibungen Detail und Tiefe zu verleihen.",
  "Verben": "Verben",
  ": Master the use of verbs, particularly those with prepositions, to express actions and states more effectively.": ": Beherrschen Sie die Verwendung von Verben, insbesondere solchen mit Präpositionen, um Handlungen und Zustände effektiver auszudrücken.",
  "Through interactive tests and comprehensive examples, this platform aims to enhance your German grammar skills, making you more confident in your language abilities.": "Durch interaktive Tests und umfassende Beispiele zielt diese Plattform darauf ab, Ihre deutschen Grammatikkenntnisse zu verbessern und Sie sicherer in Ihren Sprachfähigkeiten zu machen.",
  "The Konnektoren examples featured here are derived from the German DTB C1 Course.": "Die hier vorgestellten Konnektoren-Beispiele stammen aus dem deutschen DTB-C1-Kurs.",
  "Special thanks to the educators and learners at the IFS Academy for their contributions to the course materials.": "Ein besonderer Dank gilt den Lehrkräften und Lernenden der IFS Akademie für ihre Beiträge zu den Kursmaterialien."
}
