{
  "Welcome to Konnektoren": "Konnektörlere Hoş Geldiniz",
  "About this Learning Platform": "Bu Öğrenme Platformu Hakkında",
  "Please select a language from the dropdown.": "Lütfen açılır menüden bir dil seçin.",
  "Please select a language:": "Lütfen bir dil seçin:",
  "Select Language": "Dil Seçin",
  "This platform is dedicated to helping individuals improve their understanding and use of German grammar. Specifically, you can learn about:": "Bu platform, bireylerin Alman dilbilgisini anlama ve kullanma becerilerini geliştirmeye adanmıştır. Özellikle şunları öğrenebilirsiniz:",
  "Config": "Yapılandırma",
  "Player Profile": "Oyuncu Profili",
  "Use a nickname as your name. It will be used for certificates and displayed on the leaderboard.": "Adınız olarak bir takma ad kullanın. Sertifikalar için kullanılacak ve liderlik tablosunda görüntülenecektir.",
  "Connect your Solana account to receive NFTs as rewards for top players.": "Üst düzey oyuncular için ödül olarak NFT'ler almak için Solana hesabınızı bağlayın.",
  "Name (Nickname): ": "Ad (Takma Ad): ",
  "Solana Account: ": "Solana Hesabı: ",
  "Learning History": "Öğrenme Geçmişi",
  "Tests Taken by Type": "Türüne Göre Alınan Testler",
  "Average Performance by Test Type": "Test Türüne Göre Ortalama Performans",
  "Test History": "Test Geçmişi",
  "Leaderboard": "Liderlik Tablosu",
  "Loading...": "Yükleniyor...",
  "Only the top 25% of the leaderboard is shown.": "Liderlik tablosunun sadece en üst %25'i gösterilir.",
  "Konnektoren": "Konnektörler",
  ": Understand how to connect clauses and sentences to improve the flow of your German writing and speaking.": ": Alman yazı ve konuşmanızın akışını iyileştirmek için cümleleri ve cümleleri nasıl bağlayacağınızı anlayın.",
  "Adjektive": "Sıfatlar",
  ": Dive into the use of adjectives, including those with prepositions, to add detail and depth to your descriptions.": ": Tanımlamalarınıza ayrıntı ve derinlik eklemek için sıfatların kullanımına dalın, bu da ön ekleri olanları içerir.",
  "Verben": "Fiiller",
  ": Master the use of verbs, particularly those with prepositions, to express actions and states more effectively.": ": Fiil kullanımını, özellikle edatları olanları, eylemleri ve durumları daha etkili bir şekilde ifade etmek için ustalaşın.",
  "Through interactive tests and comprehensive examples, this platform aims to enhance your German grammar skills, making you more confident in your language abilities.": "Etkileşimli testler ve kapsamlı örnekler aracılığıyla, bu platform Alman dilbilgisini becerilerinizi geliştirmeyi hedefler ve dil becerilerinizde daha kendinize güvenli olmanızı sağlar.",
  "The Konnektoren examples featured here are derived from the German DTB C1 Course.": "Burada yer alan Konnektoren örnekleri Almanca DTB C1 Kursu'ndan alınmıştır.",
  "Special thanks to the educators and learners at the IFS Academy for their contributions to the course materials.": "Kurs materyallerine katkıda bulunan IFS Akademisi'ndeki eğitimciler ve öğrencilere özel teşekkürler.",
  "Profile": "Profil",
  "History": "Geçmiş",
  "About": "Hakkında",
  "Congratulations!": "Tebrikler!",
  "Outstanding! You've mastered this topic with excellent results.": "Mükemmel! Bu konuyu mükemmel sonuçlarla ustalaştınız.",
  "Excellent job! You're well on your way to becoming an expert.": "Harika iş! Bir uzman olma yolunda iyi ilerliyorsunuz.",
  "Very good! Your hard work is paying off.": "Çok iyi! Sıkı çalışmanız meyvesini veriyor.",
  "Good job! Keep studying, and you'll see even more improvement.": "İyi iş! Çalışmaya devam edin ve daha fazla gelişme göreceksiniz.",
  "A solid attempt! Review the materials and try again for a better score.": "Sağlam bir girişim! Materyalleri gözden geçirin ve daha iyi bir skor için tekrar deneyin.",
  "It looks like this topic is still a bit tough for you. Don't worry, with more practice, you'll get there!": "Görünüşe göre bu konu hala biraz zor sizin için. Endişelenmeyin, daha fazla pratikle başaracaksınız!",
  "Konnektoren are conjunctions that connect two clauses or sentences. They are used to express the relationship between the two clauses or sentences.": "Konnektoren, iki cümleyi veya cümleciği birbirine bağlayan bağlaçlardır. İki cümleciğin veya cümlenin ilişkisini ifade etmek için kullanılırlar.",
  "There are three types of Konnektoren and two types of exceptions:": "Üç tür Konnektoren ve iki tür istisna vardır:",
  "Konnektoren mit Nebensatz (Verb am Ende) (= Subjunktionen)": "Konnektoren mit Nebensatz (Fiil sonunda) (= Subjunktionen)",
  "Konnektoren mit Hauptsatz (Position 0) (= Konjunktionen)": "Konnektoren mit Hauptsatz (Pozisyon 0) (= Konjunktionen)",
  "Konnektoren mit Hauptsatz (Position 1) (= Konjunktionaladverbien)": "Konnektoren mit Hauptsatz (Pozisyon 1) (= Konjunktionaladverbien)",
  "Konnektoren mit Infinitivgruppe": "Konnektoren mit Infinitivgruppe",
  "Konnektoren mit besonderer Position": "Konnektoren mit besonderer Position",
  "Each type of Konnektor has its own set of rules and usage, and mastering them will help you express yourself more clearly and effectively in German.": "Her Konnektor türünün kendi kuralları ve kullanımı vardır ve onları ustalaşmak size Almanca'da kendinizi daha net ve etkili bir şekilde ifade etmenize yardımcı olacaktır.",
  "Your Task": "Göreviniz",
  "You will be shown a Konnektor and you will have to select the correct group it belongs to. This exercise aims to help you understand the usage and position of different Konnektoren within a sentence.": "Size bir Konnektor gösterilecek ve onun hangi gruba ait olduğunu seçmeniz gerekecek. Bu alıştırma, cümle içinde farklı Konnektorenin kullanımını ve konumunu anlamanıza yardımcı olmayı amaçlar.",
  "To successfully complete this task, you should:": "Bu görevi başarıyla tamamlamak için şunları yapmalısınız:",
  "First, find the Konnektor in the given sentence. Most sentences will have two parts, typically separated by a comma.": "İlk olarak, verilen cümledeki Konnektorü bulun. Çoğu cümle genellikle bir virgülle ayrılmış iki kısımdan oluşur.",
  "Identify to which part of the sentence the Konnektor belongs.": "Konnektorün cümlenin hangi kısmına ait olduğunu belirleyin.",
  "Next, find the verb in the sentence and analyze its position.": "Ardından, cümledeki fiili bulun ve pozisyonunu analiz edin.",
  "Based on the position of the verb and the part of the sentence the Konnektor belongs to, select the correct group of Konnektoren.": "Fiilin pozisyonu ve Konnektorün ait olduğu cümle kısmına göre, doğru Konnektoren grubunu seçin.",
  "Words in the parentheses, behind the group name, are meant to help you memorize the rules of the Konnektor and the group to which it belongs.": "Parantez içindeki kelimeler, grup adının arkasında, Konnektorün kurallarını ve hangi gruba ait olduğunu hatırlamanıza yardımcı olmak için kullanılır.",
  "By practicing the identification and correct classification of Konnektoren, you will enhance your ability to construct and understand complex German sentences.": "Konnektorenin tanımlanması ve doğru sınıflandırılmasını uygulayarak, karmaşık Almanca cümleleri kurma ve anlama becerinizi geliştireceksiniz.",
  "Konnektoren: Test Your Knowledge": "Konnektoren: Bilginizi Test Edin",
  "The Konnektoren test mode is designed for learners who want to challenge their understanding of German conjunctions without the need for examples.": "Konnektoren test modu, örnekler olmadan Almanca bağlaçlar hakkındaki anlayışlarını sınamak isteyen öğrenciler için tasarlanmıştır.",
  "Who needs it?": "Kimler ihtiyaç duyar?",
  "Individuals looking to assess their knowledge of Konnektoren.": "Konnektörler konusundaki bilgilerini değerlendirmek isteyen kişiler.",
  "Those preparing for a German language exam and wishing to test themselves in advance.": "Almanca dil sınavına hazırlanan ve kendilerini önceden test etmek isteyenler.",
  "Learners seeking a quick and efficient way to master all Konnektoren.": "Tüm Konnektörleri hızlı ve etkili bir şekilde öğrenmek isteyen öğrenciler.",
  "Why do you need it?": "Neden ihtiyacınız var?",
  "Konnektoren are crucial for passing German exams.": "Konnektörler Almanca sınavlarını geçmek için çok önemlidir.",
  "Enhances understanding of the German language.": "Almanca dilinin anlaşılmasını artırır.",
  "Common errors in using Konnektoren can cause misunderstandings and mistakes.": "Konnektörlerin yanlış kullanımı yaygın hatalara ve yanlış anlamalara neden olabilir.",
  "It's a fundamental aspect of the language that every learner should master.": "Her öğrencinin ustalaşması gereken dilin temel bir yönüdür.",
  "Mastering Konnektoren is key to success in any German language examination. By learning them thoroughly, you will be able to speak and write in German confidently, clearly, and without mistakes. Prepare to impress with your flawless grammar and articulate expression!": "Konnektörleri ustalaşmak, herhangi bir Almanca dil sınavında başarının anahtarıdır. Onları tam olarak öğrenerek, Almanca konuşabilir ve yazabilir, kendinizi güvenli, açık ve hata yapmadan ifade edebilirsiniz. Kusursuz dilbilgisi ve açık ifadeyle etkileyici olmaya hazırlanın!",
  "Embrace the challenge, elevate your German, and speak with pride. Your journey to German fluency starts now!": "Zorluğu kabul edin, Almanca'nızı yükseltin ve gururla konuşun. Almanca akıcılığına olan yolculuğunuz şimdi başlıyor!",
  "Adjectives are words that describe or modify another person or thing in the sentence. In German, adjectives can precede the noun they describe, which is known as the attributive position, or they can appear in the predicate, following a form of the verb to be (sein), which is known as the predicative position.": "Sıfatlar, cümledeki başka bir kişiyi veya şeyi tanımlayan veya değiştiren kelimelerdir. Almanca'da sıfatlar tanımladıkları isimden önce gelebilir, bu niteliksel konum olarak bilinir, veya yüklemde, olmak fiilinin bir biçimini izleyerek görünebilirler, bu da yargısal konum olarak bilinir.",
  "One of the key features of German adjectives is declension. German adjectives change their endings based on the gender, case, and number of the nouns they describe. This declension can seem daunting at first, but it is crucial for the correct sentence structure and meaning.": "Almanca sıfatların önemli özelliklerinden biri çekimdir. Almanca sıfatlar, tanımladıkları ismin cinsiyetine, durumuna ve sayısına bağlı olarak son eklerini değiştirir. Bu çekim başlangıçta korkutucu görünebilir, ancak doğru cümle yapısı ve anlamı için önemlidir.",
  "There are three types of adjectives in German based on their declension patterns:": "Almanca'da sıfatların üç türü vardır ve bunlar çekim kalıplarına göre belirlenir:",
  "Weak declension": "Zayıf çekim",
  "Strong declension": "Güçlü çekim",
  "Mixed declension": "Karışık çekim",
  "Understanding when to use which declension is essential for mastering German adjectives.": "Hangi çekimi kullanmanın gerektiğini anlamak, Almanca sıfatları ustalaşmak için temel bir öneme sahiptir.",
  "You will be presented with sentences where you must identify the correct form of the adjective based on the context of the sentence. This exercise will help you understand the declension of adjectives and how they change to match the nouns they describe.": "Cümlelerle karşılaşacaksınız ve cümlenin bağlamına bağlı olarak sıfatın doğru formunu belirlemeniz gerekecek. Bu alıştırma, sıfatların çekimini ve tanımladıkları isimlere uyum sağlamak için nasıl değiştiklerini anlamanıza yardımcı olacaktır.",
  "To successfully complete this task, consider the following steps:": "Bu görevi başarıyla tamamlamak için aşağıdaki adımları düşünün:",
  "Identify the noun that the adjective describes.": "Sıfatın tanımladığı ismi belirleyin.",
  "Determine the gender, case, and number of the noun.": "İsimin cinsiyetini, durumunu ve sayısını belirleyin.",
  "Select the correct adjective form based on the declension pattern.": "Çekim kalıbına dayanarak doğru sıfat formunu seçin.",
  "Practicing with a variety of sentences will help you become more comfortable with adjective declension and usage in German.": "Çeşitli cümlelerle pratik yapmak, Almanca'da sıfat çekimi ve kullanımı konusunda daha rahat olmanıza yardımcı olacaktır.",
  "Adjectives: Test Your Knowledge": "Sıfatlar: Bilginizi Test Edin",
  "Challenge your understanding of German adjectives with this test mode, designed for learners seeking to assess and improve their adjective usage.": "Bu test modu ile Almanca sıfatlar hakkındaki anlayışınızı sınayın ve geliştirmek isteyen öğrenciler için tasarlanmıştır.",
  "Why it's beneficial:": "Neden faydalıdır:",
  "Assess your knowledge of adjective declension and placement.": "Sıfat çekimi ve yerleşimi konusundaki bilginizi değerlendirin.",
  "Identify areas for improvement in adjective usage.": "Sıfat kullanımında iyileştirilmesi gereken alanları belirleyin.",
  "Prepare for German language exams with focused practice.": "Odaklanmış pratikle Almanca dil sınavlarına hazırlanın.",
  "Mastering adjectives is essential for expressing detailed and accurate descriptions in German. Take this opportunity to strengthen your skills and build confidence in your German language abilities.": "Sıfatları ustalaşmak, Almanca'da detaylı ve doğru tanımlamalar yapmanın temelidir. Bu fırsatı kullanarak becerilerinizi güçlendirin ve Almanca dil yeteneklerinizde özgüven kazanın.",
  "Dive into the challenge and emerge with a deeper understanding of German adjectives. Your path to German fluency is enriched with every step forward!": "Zorluğa dalın ve Almanca sıfatlar hakkında daha derin bir anlayışla ortaya çıkın. Almanca akıcılığınıza giden yol her adımınızla zenginleşiyor!",
  "Verbs are the most important part of any sentence. They are the action words that express what the subject is doing. In German, verbs are conjugated to match the subject of the sentence, and they can be used in different tenses and moods.": "Fiiller herhangi bir cümlenin en önemli parçasıdır. Onlar, öznenin ne yaptığını ifade eden eylem kelimeleridir. Almanca'da fiiller, cümlenin öznesine uyacak şekilde çekimlenir ve farklı zamanlarda ve modlarda kullanılabilirler.",
  "There are three types of verbs in German:": "Almanca'da üç tür fiil vardır:",
  "Regular verbs": "Düzenli fiiller",
  "Irregular verbs": "Düzensiz fiiller",
  "Modal verbs": "Modal fiiller",
  "Each type of verb has its own set of rules and usage, and mastering them will help you express yourself more clearly and effectively in German.": "Her tür fiilin kendi kuralları ve kullanımı vardır ve onları ustalaşmak, kendinizi Almanca'da daha net ve etkili bir şekilde ifade etmenize yardımcı olacaktır.",
  "By practicing the identification and correct classification of verbs, you will enhance your ability to construct and understand complex German sentences.": "Fiillerin tanımlanması ve doğru sınıflandırılmasını pratiğe dökerek, karmaşık Almanca cümleler kurma ve anlama yeteneğinizi geliştireceksiniz.",
  "Verben: Test Your Knowledge": "Fiiller: Bilginizi Test Edin",
  "The Verben test mode is designed for learners who want to challenge their understanding of German verbs without the need for examples.": "Fiiller test modu, örnekler olmadan Almanca fiillerin anlayışını sınamak isteyen öğrenciler için tasarlanmıştır.",
  "Individuals looking to assess their knowledge of German verbs.": "Almanca fiiller hakkındaki bilgilerini değerlendirmek isteyen kişiler.",
  "Learners seeking a quick and efficient way to master all German verbs.": "Tüm Almanca fiilleri hızlı ve etkili bir şekilde öğrenmek isteyen öğrenciler.",
  "Verbs are crucial for passing German exams.": "Fiiler, Almanca sınavlarını geçmek için hayati öneme sahiptir.",
  "Common errors in using verbs can cause misunderstandings and mistakes.": "Fiillerin yanlış kullanımındaki yaygın hatalar yanlış anlamalara ve hatalara neden olabilir.",
  "Mastering verbs is key to success in any German language examination. By learning them thoroughly, you will be able to speak and write in German confidently, clearly, and without mistakes. Prepare to impress with your flawless grammar and articulate expression!": "Fiillerin ustalaşması, herhangi bir Almanca dil sınavında başarının anahtarıdır. Onları tam olarak öğrenerek, Almanca konuşabilir ve yazabilir, kendinizi güvenli, açık ve hata yapmadan ifade edebilirsiniz. Kusursuz dilbilgisi ve açık ifadeyle etkileyici olmaya hazırlanın!",
  "Connect Wallet": "Cüzdan Bağla",
  "Certificate": "Sertifika",
  "If you can make the test without help of the examples, you can earn a certificate.": "Eğer örneklerin yardımı olmadan testi yapabilirseniz, bir sertifika alabilirsiniz.",
  "If you can make the test with a performance of 80% and more, you can get a nft.": "Eğer %80 ve üzeri bir performansla testi yapabilirseniz, bir NFT alabilirsiniz."
}
